src/cf/Catalogs/инт_ПодписчикиПодсистемаИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_ПодписчикиПодсистемаИнтеграции</Name>
			<Comment>Подписчики для отправки в другую базу с подсистемой интеграции</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Эндпоинт</Name>
					<Comment>HTTP-сервис подсистемы интеграции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Эндпоинты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПотокаПриёмника</Name>
					<Comment>UUID потока в базе-приёмнике</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПостПроцессинг</Name>
					<Comment>Обработчики по кодам HTTP-ответа</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСостояния</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Comment>BSL-код обработчика</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/инт_Подписчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_Подписчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособПередачиИдентификатораСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СпособыПередачиПараметровПоHTTP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиИдентификатораПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СпособыПередачиПараметровПоHTTP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодписчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыПодписчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Эндпоинты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах.(0 - сообщение будет обработано повторно как можно быстрее)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТопика</Name>
					<Comment>Имя топика kafka</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетнаяОбработка</Name>
					<Comment>Сообщения будут отправлены не сразу, а перед завершением обработки потока одним пакетом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПостПроцессинг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСостояния</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/инт_ПодписчикиПодсистемаИнтеграции/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// инт_ПодписчикиПодсистемаИнтеграции.ФормаЭлемента
// Форма подписчика для обмена с другой базой по подсистеме интеграции
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Инициализация
КонецПроцедуры



#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормыПостПроцессинг

&НаКлиенте
Процедура ПостПроцессингОбработчикНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("ТекстОбработчика", Элемент.ТекстРедактирования);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияРедактированияОбработчика", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.инт_Подписчики.Форма.ФормаРедактированияОбработчика",
		ДопПараметры,
		Элемент,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияРедактированияОбработчика(ТекстОбработчика, ДополнительныеПараметры) Экспорт
	
	Если ТекстОбработчика = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПостПроцессинг.ТекущиеДанные.Обработчик = ТекстОбработчика;
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ТестПодключения(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Эндпоинт) И НЕ ЗначениеЗаполнено(ЭтотОбъект["АдресРесурса"]) Тогда
		ПоказатьПредупреждение(, "Не указан эндпоинт или адрес ресурса!");
		Возврат;
	КонецЕсли;
	
	Результат = ВыполнитьТестПодключенияНаСервере();
	
	Если Результат.Успех Тогда
		ТекстСообщения = СтрШаблон("Подключение к подсистеме интеграции успешно!
			|
			|Код ответа: %1", Результат.КодСостояния);
		ПоказатьПредупреждение(, ТекстСообщения);
	Иначе
		ПоказатьПредупреждение(, "Ошибка подключения: " + Результат.ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыполнитьТестПодключенияНаСервере()
	
	Результат = Новый Структура("Успех, ОписаниеОшибки, КодСостояния", Ложь, "", 0);
	
	Попытка
		АдресРесурса = ЭтотОбъект["АдресРесурса"];
		Если НЕ ЗначениеЗаполнено(АдресРесурса) Тогда
			Результат.ОписаниеОшибки = "Не указан адрес ресурса";
			Возврат Результат;
		КонецЕсли;
		
		// Проверка доступности HTTP-сервиса подсистемы интеграции
		URLПроверки = СтрШаблон("%1/hs/api/v1/ping", АдресРесурса);
		Ответ = инт_КоннекторHTTP.Get(URLПроверки);
		Результат.Успех = (Ответ.КодСостояния >= 200 И Ответ.КодСостояния < 500);
		Результат.КодСостояния = Ответ.КодСостояния;
	Исключение
		Результат.ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
